app/controllers/my_bookmarks_controller.rb

SELECT "my_bookmarks".* FROM "my_bookmarks"
---
  def index
    @my_bookmarks = MyBookmark.all.reverse

INSERT INTO "my_bookmarks" ("site_name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["site_name", "fgrsegtrh"], ["created_at", "2020-02-16 00:58:21.885781"], ["updated_at", "2020-02-16 00:58:21.885781"]]
---
  def create
    @my_bookmark = MyBookmark.new(my_bookmark_params)

    if @my_bookmark.save

UPDATE "my_bookmarks" SET "site_name" = $1, "updated_at" = $2 WHERE "my_bookmarks"."id" = $3  [["site_name", "sfrgtdgdtr"], ["updated_at", "2020-02-16 00:57:51.551178"], ["id", 2]]
---
  def update
    @my_bookmark.update(my_bookmark_params)

DELETE FROM "my_bookmarks" WHERE "my_bookmarks"."id" = $1  [["id", 6]]
---
  def destroy
    @my_bookmark.destroy

SELECT "my_bookmarks".* FROM "my_bookmarks" WHERE "my_bookmarks"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
    def set_my_bookmark
      @my_bookmark = MyBookmark.find(params[:id])